*> This is free-form
IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.
ENVIRONMENT DIVISION.
DATA DIVISION.
PROCEDURE DIVISION.
    DISPLAY "Hello from GNU COBOL in Docker + VS Code!".
    DISPLAY "Test"
    STOP RUN.
